# NewIntersectionResultArray Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewIntersectionResultArray Method
Application Class See Also
---
Creates a new instance of an IntersectionResult array.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntersectionResultArray NewIntersectionResultArray()
```

Visual Basic
---
```text
Public Function NewIntersectionResultArray As IntersectionResultArray
```

Visual C++
---
```text
public:
IntersectionResultArray^ NewIntersectionResultArray()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace